api/controllers/CpController.php

SELECT EXISTS(SELECT * FROM `epr_enteprise` WHERE `epr_enteprise`.`msisdn`='329717979')
INSERT INTO `epr_enteprise` (`msisdn`, `email`, `full_name`, `password`, `auth_key`, `password_reset_token`, `status`, `created_at`, `id_number`, `updated_at`) VALUES ('329717979', 'phongnhhh92@gmail.com', '329717979', 'ff22434f771b2cd22f938ed57846a6038b7e4c2e', 'Yy_det3pfkLR7XsBnKr-CSZhJ1ozaRW-', 'vV9BGbu9hwRTSJLBH1j-XgIkqEJequga_1609384968', 1, NOW(), '', NOW())
---
    public function actionCreateCrbt() {
        $type = $this->getParam('type', '');
        $name = $this->getParam('name', '');
        $amMail = $this->getParam('am_mail', '');
        $amIsdn = \common\helpers\Helpers::convertMsisdn($this->getParam('am_isdn', ''));
        $brandId = $this->getParam('brand_id', '');

        if (!preg_match(\Yii::$app->params['viettel_phone_expression'], $amIsdn)) {
            return \api\libs\ApiHelper::formatResponse(\api\libs\ApiResponseCode::ISDN_INVALID);
        }
        $entepriseIsDelete = false;
//        $enteprise = \api\models\Enteprise::find()->where(['msisdn' => $amIsdn])->one();
        $enteprise = Enteprise::findByMsisdn($amIsdn);
        if (!$enteprise) {
            $entepriseIsDelete = true;
            $enteprise = new Enteprise();
            $enteprise->msisdn = $amIsdn;
            $enteprise->email = $amMail;
            $enteprise->full_name = $amIsdn;
            $enteprise->setPassword($amIsdn);
            $enteprise->generateAuthKey();
            $enteprise->generatePasswordResetToken();
            $enteprise->status = 1;
            $enteprise->created_at = new \yii\db\Expression('now()');

INSERT INTO `epr_enterprise_file` (`enterprise_id`, `business_license`, `copyright_license`, `requires_recording`, `recording_file`, `status`, `name`, `source`, `brand_id`, `created_at`, `msisdn_pay`, `updated_at`) VALUES (262, '', '/docs/c0/9e/ec/5fed45fba1660.pdf', 0, '/rbt/67/09/96/5fed45fba37f1.mp3', 6, 'bai hat test', 'test', 72, NOW(), '', NOW())
INSERT INTO `epr_enterprise_file` (`enterprise_id`, `business_license`, `copyright_license`, `requires_recording`, `recording_file`, `status`, `name`, `source`, `brand_id`, `created_at`, `msisdn_pay`, `updated_at`) VALUES (262, '', '/docs/f0/e8/8f/5fed5396bba03.pdf', 0, '/rbt/c7/97/7c/5fed5396bd30b.mp3', 6, 'bai hat test', 'test', 72, NOW(), '', NOW())
---
        $enterpriseFile->name = $name;
        $enterpriseFile->source = $this->getParam('client_id', '');
        $enterpriseFile->brand_id = $brandId;
        $enterpriseFile->created_at = new \yii\db\Expression('now()');
        if (!$enterpriseFile->save()) {

DELETE FROM `epr_enterprise_file` WHERE `id`='1046'
---
                        'tone_id' => $rbt->tone_id,
            ]);
        } else {
            $enterpriseFile->delete();