api/models/ApiClient.php

SELECT * FROM `api_client` WHERE (`client_id`='bccs') AND (`client_secret`='7729b60691769620f6ce45807ab6dc83')
---
    static function getClientBySecret($client_id, $client_secret) {
        $cache = Yii::$app->cache;
        $key = "ApiClient_getClientBySecret_" . $client_id . '_' . $client_secret;
        $data = $cache->get($key);
        if (!$data) {
            $data = ApiClient::find()
                            ->where([
                                'client_id' => $client_id,
                                'client_secret' => $client_secret
                            ])->one();