api/models/Enteprise.php

    public static function findByMsisdn($msisdn) {
        return static::findOne(['msisdn' => \common\helpers\Helpers::convertMsisdn($msisdn), 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `epr_enteprise` WHERE (`msisdn`='329717979') AND (`status`=1)